{
  "hypothesis": [
    "We aim to assess a neural network’s ability to predict a flux rope’s orientation after an ICME is identified."
  ],
  "supportingArguments": [
    "The training phase consists of showing the network the input-output pairs of simulated flux rope magnetic field vectors and the corresponding key parameters used to create this simulated data trace.",
    "Various physics-based flux rope models exist that can be used to reconstruct the internal ICME magnetic configuration."
  ],
  "researchOpportunities": [
    "Research into where the convolutional network is looking (for example, with the Grad-CAM method) can help further understand the benefits and limitations of hodograms and time series as inputs.",
    "Implementing a single, physics-based loss function into the CNN to replace the four separate loss functions in the current design."
  ],
  "methodology": [
    "The circular-cylindrical flux rope model of Nieves-Chinchilla et al. was used to simulate the magnetic field signature of flux ropes.",
    "Convolutional neural networks (CNNs) were used, and the training phase involved learning filters that lead to optimal predictions.",
    "Synthetic data was generated by simulating 98,000 combinations of flux ropes and examining various percentages of these during spacecraft crossings."
  ],
  "results": [
    "CNNs provided reliable characterizations of flux ropes from synthetic data, making accurate predictions even after seeing just a fraction of the flux rope.",
    "The 1D CNN performed best, exhibiting reliable predictions over the entire range of simulated spacecraft impact parameters."
  ],
  "conclusions": [
    "The neural network can predict a flux rope's orientation having only seen a portion of the event, which is promising for real-time forecasting in space weather."
  ],
  "limitations": [
    "The CNNs trained on synthetic data do not transfer perfectly to Wind spacecraft data due to differences in the physical characteristics of real and simulated events.",
    "The introduction of partial flux ropes into training produced more errors, possibly due to multiple inputs producing the same output."
  ],
  "futureDirections": [
    "Enhance analytical flux rope models to include more realistic turbulence and asymmetry.",
    "Explore a neural network’s performance using different physics-based flux rope models."
  ],
  "keyFindings": [
    "1D CNNs using time series input gave more accurate flux rope predictions than 2D CNNs using hodogram input.",
    "With synthetic data, less than 200 real flux rope events may be required to train a neural network to predict orientations reliably."
  ],
  "references": [
    "Baker DN, Lanzerotti LJ. A continuous l1 presence required for space weather. Space Weather 6 (2008).",
    "Kilpua E, Koskinen HEJ, Pulkkinen TI. Coronal mass ejections and their sheath regions in interplanetary space. Living Reviews in Solar Physics 14(2017).",
    "dos Santos LFG, Narock A, Nieves-Chinchilla T, Nuñez M, Kirk M. Identifying Flux Rope Signatures Using a Deep Neural Network. Solar Physics 295(2020).",
    "Reiss MA, Möstl C, Bailey RL, Rüdisser HT, Amerstorfer UV, et al. Machine learning for predicting the bz magnetic field component from upstream in situ observations of solar coronal mass ejections. Space Weather 19(2021).",
    "Nieves-Chinchilla T, Vourlidas A, Raymond JC, Linton MG, Al-haddad N, Savani NP, et al. Understanding the Internal Magnetic Field Configurations of ICMEs Using More than 20 Years of Wind Observations. Solar Physics 293(2018).",
    "Nieves-Chinchilla T, Linton MG, Hidalgo MA, Vourlidas A, Savani NP, Szabo A, et al. A Circular-cylindrical Flux-rope Analytical Model for Magnetic Clouds. The Astrophysical Journal 823(2016)."
  ]
}