{
  "Cardinal": [
    "EarthArXiv has emerged as a community-led initiative devoted to open scholarly communication, becoming the first preprint server for the Earth Sciences on October 23rd, 2017.",
    "EarthArXiv enables rapid communication of results before and during peer-review (preprints) as well as offers access for those without journal subscriptions (postprints), increasing the openness of science.",
    "In its first year, EarthArXiv accepted approximately 500 submissions, indicating a positive reception and potential for growth in the use of preprints in the Earth sciences.",
    "The increasing preprint to postprint ratio and statistics on downloads and submissions suggest that the Earth sciences are embracing preprints and open access.",
    "EarthArXiv has a diverse range of sub-disciplines contributing, as indicated by disciplinary tags and journals associated with deposited preprints."
  ],
  "Supporting": [
    "Preprints and postprints are associated with rapid citations and social media discussions, increasing accessibility of academic work beyond typical journal subscribers.",
    "The original preprint repository ArXiv has been in use for over 25 years, predominantly covering physics, mathematics, and computer science.",
    "EarthArXiv's 500 accepted submissions are associated with 1,419 unique authors and have an average of 2763 monthly downloads.",
    "EarthArXiv opened with a targeted social media campaign and receives an average of 10 new submissions per week.",
    "48 EarthArXiv manuscripts are linked to AGU articles, and several sub-disciplines have more representation than others, such as geophysics and sedimentology.",
    "Authors are encouraged to provide a second, journal-assigned DOI after peer-reviewed publication; EarthArXiv's moderation policy and digital object identifier assignment support provenance and citability.",
    "Preprints gain feedback from the community through public commentary enabled by EarthArXiv's integration with Hypothes.is.",
    "Preprints offer open access during the review process, promoting collaborations and accelerating the dissemination of research."
  ]
}